emgre/cc3200-rs/cc3200-pac/svd/CC3200.svd
        <register derivedFrom="CAMCLKEN">
          <name>MCASPCLKEN</name>
          <description>I2S Clock Enable</description>
          <addressOffset>0x014</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>MCASPSWRST</name>
          <description>I2S Software Reset</description>
          <addressOffset>0x018</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>SDIOMCLKEN</name>
          <description>SD Host Clock Enable</description>
          <addressOffset>0x024</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>SDIOMSWRST</name>
          <description>SD Host Software Reset</description>
          <addressOffset>0x028</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>APSPICLKEN</name>
          <description>SPI Clock Enable</description>
          <addressOffset>0x030</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>APSPISWRST</name>
          <description>SPI Software Reset</description>
          <addressOffset>0x034</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>DMACLKEN</name>
          <description>DMA Clock Enable</description>
          <addressOffset>0x048</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>DMASWRST</name>
          <description>DMA Software Reset</description>
          <addressOffset>0x04C</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPIO0CLKEN</name>
          <description>GPIO0 Clock Enable</description>
          <addressOffset>0x050</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPIO0SWRST</name>
          <description>GPIO0 Software Reset</description>
          <addressOffset>0x054</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPIO1CLKEN</name>
          <description>GPIO1 Clock Enable</description>
          <addressOffset>0x058</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPIO1SWRST</name>
          <description>GPIO1 Software Reset</description>
          <addressOffset>0x05C</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPIO2CLKEN</name>
          <description>GPIO2 Clock Enable</description>
          <addressOffset>0x060</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPIO2SWRST</name>
          <description>GPIO2 Software Reset</description>
          <addressOffset>0x064</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPIO3CLKEN</name>
          <description>GPIO3 Clock Enable</description>
          <addressOffset>0x068</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPIO3SWRST</name>
          <description>GPIO3 Software Reset</description>
          <addressOffset>0x06C</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPIO4CLKEN</name>
          <description>GPIO4 Clock Enable</description>
          <addressOffset>0x070</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPIO4SWRST</name>
          <description>GPIO4 Software Reset</description>
          <addressOffset>0x074</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>WDTCLKEN</name>
          <description>Watchdog Clock Enable</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BAUDCLKSEL</name>
              <description>Baud Clock Select</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLPCLKEN</name>
              <description>Deepsleep Clock Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLPCLKEN</name>
              <description>Sleep Clock Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNCLKEN</name>
              <description>Run Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>WDTSWRST</name>
          <description>Watchdog Software Reset</description>
          <addressOffset>0x07C</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>UART0CLKEN</name>
          <description>UART0 Clock Enable</description>
          <addressOffset>0x080</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>UART0SWRST</name>
          <description>UART0 Software Reset</description>
          <addressOffset>0x084</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>UART1CLKEN</name>
          <description>UART1 Clock Enable</description>
          <addressOffset>0x088</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>UART1SWRST</name>
          <description>UART1 Software Reset</description>
          <addressOffset>0x08C</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPT0CLKEN</name>
          <description>GPT0 Clock Enable</description>
          <addressOffset>0x090</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPT0SWRST</name>
          <description>GPT0 Software Reset</description>
          <addressOffset>0x094</addressOffset>
        </register>
