emgre/cc3200-rs/cc3200-pac/svd/CC3200.svd
        <register derivedFrom="CAMCLKEN">
          <name>GPT1CLKEN</name>
          <description>GPT1 Clock Enable</description>
          <addressOffset>0x098</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPT1SWRST</name>
          <description>GPT1 Software Reset</description>
          <addressOffset>0x09C</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPT2CLKEN</name>
          <description>GPT2 Clock Enable</description>
          <addressOffset>0x0A0</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPT2SWRST</name>
          <description>GPT2 Software Reset</description>
          <addressOffset>0x0A4</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>GPT3CLKEN</name>
          <description>GPT3 Clock Enable</description>
          <addressOffset>0x0A8</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>GPT3SWRST</name>
          <description>GPT3 Software Reset</description>
          <addressOffset>0x0AC</addressOffset>
        </register>
        <register derivedFrom="CAMCLKEN">
          <name>I2CCLKEN</name>
          <description>I2C Clock Enable</description>
          <addressOffset>0x0D8</addressOffset>
        </register>
        <register derivedFrom="CAMSWRST">
          <name>I2CSWRST</name>
          <description>I2C Software Reset</description>
          <addressOffset>0x0DC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OCP_SHARED</name>
      <description>MCU Shared Configuration</description>
      <baseAddress>0x4402E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPIO_PAD_CONFIG_0</name>
          <description>GPIO0 / (ANA) (Pin 50) Pad Config</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO0</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0 Request To Send O (Active Low)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAXR0</name>
                  <description>I2S Audio Port Data 0 (RX/TX)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAXR1</name>
                  <description>I2S Audio Port Data 1 (RX/TX)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP00</name>
                  <description>Timer Capture Port</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSPI_CS</name>
                  <description>General SPI Chip Select</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1 Request To Send O (Active Low)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0 Clear To Send Input (Active Low)</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_1</name>
          <description>GPIO1 (Pin 55) Pad Config</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO1</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <description>UART0 TX Data</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIXCLK</name>
                  <description>Pixel Clock from Parallel Camera Sensor</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX</name>
                  <description>UART1 TX Data</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP01</name>
                  <description>Timer Capture Port</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_2</name>
          <description>GPIO2 (Pin 57) Pad Config</description>
          <addressOffset>0x0A8</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO2</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX</name>
                  <description>UART0 RX Data</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX</name>
                  <description>UART1 RX Data</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP02</name>
                  <description>Timer Capture Port</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_3</name>
          <description>GPIO3 (Pin 58) Pad Config</description>
          <addressOffset>0x0AC</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO3</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAM_D3</name>
                  <description>Parallel Camera Data Bit 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX</name>
                  <description>UART1 TX Data</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
