emgre/cc3200-rs/cc3200-pac/svd/CC3200.svd
        <register>
          <name>GPIO_PAD_CONFIG_4</name>
          <description>GPIO4 (Pin 59) Pad Config</description>
          <addressOffset>0x0B0</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO4</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAM_D2</name>
                  <description>Parallel Camera Data Bit 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX</name>
                  <description>UART1 RX Data</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_5</name>
          <description>GPIO5 (Pin 60) Pad Config</description>
          <addressOffset>0x0B4</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO5</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAM_D1</name>
                  <description>Parallel Camera Data Bit 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAXR1</name>
                  <description>I2S Audio Port Data 1 (RX/TX)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP05</name>
                  <description>Timer Capture Port</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_6</name>
          <description>GPIO6 (Pin 61) Pad Config</description>
          <addressOffset>0x0B8</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO6</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_CTS</name>
                  <description>UART1 Clear To Send Input (Active Low)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAM_D0</name>
                  <description>Parallel Camera Data Bit 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0 Request To Send O (Active Low)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_CTS</name>
                  <description>UART0 Clear To Send Input (Active Low)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP06</name>
                  <description>Timer Capture Port</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_7</name>
          <description>GPIO7 (Pin 62) Pad Config</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO7</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RTS</name>
                  <description>UART1 Request To Send O (Active Low)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0 Request To Send O (Active Low)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <description>UART0 TX Data</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McACLKX</name>
                  <description>I2S Audio Port Clock O</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_8</name>
          <description>GPIO8 (Pin 63) Pad Config</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO8</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDCARD_IRQ</name>
                  <description>Interrupt from SD Card</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAFSX</name>
                  <description>I2S Audio Port Frame Sync</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP06</name>
                  <description>Timer Capture Port</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
