emgre/cc3200-rs/cc3200-pac/svd/CC3200.svd
        <register>
          <name>GPIO_PAD_CONFIG_9</name>
          <description>GPIO9 (Pin 64) Pad Config</description>
          <addressOffset>0x0C4</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO9</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_PWM05</name>
                  <description>Pulse-Width Modulated O/P</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDCARD_DATA</name>
                  <description>SD Card Data</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAXR0</name>
                  <description>I2S Audio Port Data (Rx/Tx)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP00</name>
                  <description>Timer Capture Port</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_10</name>
          <description>GPIO10 (Pin 1) Pad Config</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO10</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_SCL</name>
                  <description>I2C Clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_PWM06</name>
                  <description>Pulse-Width Modulated O/P</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDCARD_CLK</name>
                  <description>SD Card Clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX</name>
                  <description>UART1 TX Data</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP01</name>
                  <description>Timer Capture Port</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_11</name>
          <description>GPIO11 (Pin 2) Pad Config</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO11</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_SDA</name>
                  <description>I2C Data</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_PWM07</name>
                  <description>Pulse-Width Modulated O/P</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XVCLK</name>
                  <description>Free Clock To Parallel Camera</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDCARD_CMD</name>
                  <description>SD Card Command Line</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX</name>
                  <description>UART1 RX Data</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP02</name>
                  <description>Timer Capture Port</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAFSX</name>
                  <description>I2S Audio Port Frame Sync</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_12</name>
          <description>GPIO12 (Pin 3) Pad Config</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO12</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McACLK</name>
                  <description>I2S Audio Port Clock O</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSYNC</name>
                  <description>Parallel Camera Vertical Sync</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_SCL</name>
                  <description>I2C Clock</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <description>UART0 TX Data</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP03</name>
                  <description>Timer Capture Port</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
