emgre/cc3200-rs/cc3200-pac/svd/CC3200.svd
        <register>
          <name>GPIO_PAD_CONFIG_23</name>
          <description>GPIO23 (TDI) (Pin 16) Pad Config</description>
          <addressOffset>0x0FC</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO23</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDI</name>
                  <description>JTAG TDI (Reset Default Pinout)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_TX</name>
                  <description>UART1 TX Data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_SCL</name>
                  <description>I2C Clock</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_24</name>
          <description>GPIO24 (TDO) (Pin 17) Pad Config</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO24</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDO</name>
                  <description>JTAG TDO (Reset Default Pinout)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX</name>
                  <description>UART1 RX Data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP06</name>
                  <description>Timer Capture Port</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0</name>
                  <description>Pulse-Width Modulated O/P</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAFSX</name>
                  <description>I2S Audio Port Frame Sync</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_SDA</name>
                  <description>I2C Data</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_25</name>
          <description>GPIO25 (SOP2) (Pin 21) Pad Config</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO25</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAFSX</name>
                  <description>I2S Audio Port Frame Sync</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_PWM02</name>
                  <description>Pulse-Width Modulated O/P</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_26</name>
          <description>GPIO26 (ANTSEL1) (Pin 29) Pad Config</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANTSEL1</name>
                  <description>Antenna Selection Control</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_27</name>
          <description>GPIO27 (ANTSEL2) (Pin 30) Pad Config</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANTSEL2</name>
                  <description>Antenna Selection Control</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
