emgre/cc3200-rs/cc3200-pac/svd/CC3200.svd
        <register>
          <name>GPIO_PAD_CONFIG_28</name>
          <description>GPIO28 (TCK) (Pin 19) Pad Config</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO28</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCK</name>
                  <description>JTAG/SWD TCK (Reset Default Pinout)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_PWM03</name>
                  <description>Pulse-Width Modulated O/P</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_29</name>
          <description>GPIO29 (TMS) (Pin 20) Pad Config</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO29</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMS</name>
                  <description>JTAG/SWD TMS (Reset Default Pinout)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_30</name>
          <description>GPIO30 (ANA) (Pin 53) Pad Config</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO30</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McACLK</name>
                  <description>I2S Audio Port Clock O</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAFSX</name>
                  <description>I2S Audio Port Frame Sync</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GT_CCP05</name>
                  <description>Timer Capture Port</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSPI_MISO</name>
                  <description>General SPI MISO</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX</name>
                  <description>UART0 TX Data</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_31</name>
          <description>GPIO31 (DCDC_ANA2_SW_P) (Pin 45) Pad Config</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO31</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RX</name>
                  <description>UART1 RX Data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAXR0</name>
                  <description>I2S Audio Port Data 0 (RX/TX)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSPI_CLK</name>
                  <description>General SPI Clock</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX</name>
                  <description>UART0 RX Data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAFSX</name>
                  <description>I2S Audio Port Frame Sync</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_CONFIG_32</name>
          <description>GPIO32 (RTC_XTAL_N) (Pin 52) Pad Config</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <size>16</size>
          <resetValue>0xC61</resetValue>
          <fields>
            <field>
              <name>CONFMODE</name>
              <description>Configuration Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO32</name>
                  <description>General-Purpose I/O</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_XTAL_N</name>
                  <description>Connect 32.768kHz XTAL or connect a 100kΩ to Vsupply</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McACLK</name>
                  <description>I2S Audio Port Clock O</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>McAXR0</name>
                  <description>I2S Audio Port Data (Only O Mode Supported On Pin 52)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RTS</name>
                  <description>UART0 Request To Send O (Active Low)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GSPI_MOSI</name>
                  <description>General SPI MOSI</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPENDRAIN</name>
              <description>Open-drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVESTRENGTH</name>
              <description>Drive Strength</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output driver not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2mA</name>
                  <description>2 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>4 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6mA</name>
                  <description>6 mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <description>8 mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10mA</name>
                  <description>10 mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <description>12 mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14mA</name>
                  <description>14 mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLUP</name>
              <description>Enable internal weak pullup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN</name>
              <description>Enable internal weak pulldown</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_ENABLE_OVERRIDE</name>
              <description>Pad output enable override value</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_BUFFER_OVERRIDE</name>
              <description>Pad output buffer override enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
